# GeoCoordinateSystemDefinition Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SiteLocation..::..GeoCoordinateSystemDefinition Property
SiteLocation Class See Also
---
The XML string which describes the geographic coordinate system.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public string GeoCoordinateSystemDefinition { get; }
```

Visual Basic
---
```text
Public ReadOnly Property GeoCoordinateSystemDefinition As String
	Get
```

Visual C++
---
```text
public:
property String^ GeoCoordinateSystemDefinition {
	String^ get ();
}
```

# Remarks
If the site does not have a geographic coordinate system, it returns an empty string for this property.
# See Also
SiteLocation Class
Autodesk.Revit.DB Namespace